# Pandas 

> pip install pandas

In [ ]:
import pandas as pd
import numpy as np

## Create a DataFrame

### 1. From Dictionary

In [ ]:
data  = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"]
}

# create a dataframe
df = pd.DataFrame(data)


# Show the top records
df.head()

In [ ]:
data  = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city" : "berlin"
}

# create a dataframe
df = pd.DataFrame(data)


# Show the top records
df.head()

In [ ]:
data  = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city" : "berlin",
    "score": np.array([3,4,8,3,1])
}

# create a dataframe
df = pd.DataFrame(data)


# Show the top records
df.head()

In [ ]:
# Re-order (or specific columns) from the data source
data  = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city" : "berlin",
    "score": np.array([3,4,8,3,1])
}

# create a dataframe
df = pd.DataFrame(data, columns= ["city", "name", "score"])


# Show the top records
df.head()

### 2. From a List

In [ ]:
# Specific Column names manually
data = [
    [1, "Thomas", "Berlin"],
    [2, "Ingo", "Berlin"],
    [3, "Sara", "Berlin"],
]



df = pd.DataFrame(data, columns = ["ID", "name", "city"])

df.head()

### 3. From JSON

In [ ]:
data = {
    "ID": {
        "0": 100,
        "1": 101,
        "2": 102,
    },
    "name": {
        "0": "Thomas",
        "1": "Ingo",
        "2": "Sara",
    }
}

df  = pd.DataFrame(data)

df.head()

### 4. Create DataFrame from External Source

In [ ]:
df = pd.read_csv("./my_data.csv")
# df = pd.read_csv("./my_data.csv", delimiter = ";")
# df = pd.read_csv("./my_data.csv", delimiter = " ")
# df = pd.read_csv("./my_data.csv", delimiter = "\t")

df.head()

In [ ]:
# Create with Index Column
df = pd.read_csv("./my_data.csv", index_col = "Order ID")
df = pd.read_csv("./my_data.csv", index_col = 0)


df.head()

In [ ]:
# After creating the dataframe
df = df.set_index("Product")
df.head()

In [ ]:
df = pd.read_csv("./my_data.csv", usecols= ["Order ID", "Product"] )
df.head()

# DataFrame Information

In [ ]:
df = pd.read_csv("./my_data.csv")
df.head()

## 1. Show Rows

In [ ]:
df.head() # top 5 records
df.head(2)

df.tail() # last 5 records
df.tail(2)

df.sample()
df.sample(3)

## 2. Show Infos

In [ ]:
df.describe()

In [ ]:
df.info()

In [ ]:
df.dtypes

In [ ]:
df.shape

In [ ]:
df.size # count of items (Not Null)

## 3. Show Columns

In [ ]:
df.head()

In [ ]:
# Access Single Column
df["Product"]
df.Product

df["Quantity Ordered"]

# Access Several Columns
df[ ["Order ID", "Product", "Price Each"] ]

## 4. Info about columns

In [ ]:
df["Product"].unique()

In [ ]:
df["Product"].unique() # Get Array of the unique values
len(df["Product"].unique()) # 21

df["Product"].nunique() # 20 - Gets the number of NON NULL unique values

df["Product"].value_counts()

In [ ]:
df["Order ID"].is_unique # False because repeated header

# Filtering

In [ ]:
data  = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city" : "berlin"
}

# create a dataframe
df = pd.DataFrame(data)


# Show the top records
df.head()

In [ ]:
df["name"] == "Thomas"

In [ ]:
df[   df["name"] == "Thomas"    ]

# Single Condition
df.loc[  df["name"] == "Thomas" ]

# Multi-Condition

In [ ]:
df.loc[  (df["name"] == "Thomas")  & (df["city"] == "berlin")  ] # and
df.loc[  (df["name"] == "Thomas")  | (df["city"] == "berlin")  ] # or

# Loop Over Data Frame

In [ ]:
for column_name in df:
    print(column_name)

In [ ]:
for row_id, row in df.iterrows():
    print(row_id, row)

# Sorting

In [ ]:
df = df.sort_values("name")

df.sort_values("name", inplace= True)

In [ ]:
df.sort_values("name", ascending= False)

In [ ]:
df.head()

In [ ]:
df.sort_index(inplace=True)
df.head()

# Concatenate Several DataFrame

In [ ]:
data1 = {
    "ID": [1,2],
    "name":["Thomas", "Ingo"],
    "city" : "Berlin"
}
data2 = {
    "ID": [3,4],
    "name":["Sara", "Lena"],
    "city" : "Aachen"
}
data3 = {
    "ID": [5,6],
    "name":["Julia", "Frank"],
    "city" : "Bonn"
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [ ]:
df = pd.concat([df1, df2, df3])
df.head(6)

# Data Types

In [ ]:
data = {
    "ID" : ["1", "2", "3"],
    "name" : ["Thomas", "Ingo", "Sara"],
    "price" : ["12.2", "13.3", "14.4"]
}

df = pd.DataFrame(data)
df.head()

df.info()

In [ ]:
# 1. Variant: 
df["ID"] = df["ID"].astype(int)
df["price"] = df["price"].astype(float)

df.info()

In [ ]:
# 2. Variant:
df["ID"] = pd.to_numeric(df["ID"])
df["price"] = pd.to_numeric(df["price"])
df.info()

In [ ]:
df.describe()

# Save the CSV File

In [ ]:
df.to_csv("./my_data_processed.csv")
df.to_csv("./my_data_processed.csv", index = False)
df.to_csv("./my_data_processed.csv", index = False, sep = ";")
df.to_csv("./my_data_processed.csv", index = False, sep = "\t")

# Drop

In [ ]:
df.head()

In [ ]:
# Delete columns
df.drop(columns=["ID"])
df.drop(columns=["ID", "name"])

In [ ]:
# Delete rows
df.drop(index = [1,2])
df.drop(index = [1,2,900], errors= "ignore")

# DropNA

In [ ]:
data  = {
    "ID": [np.nan,2,3,4,5],
    "name": ["Thomas", np.nan, "Sara", np.nan, "Julia"],
    "city" : "berlin",
    "score": np.array([np.nan,4,8,3,1])
}

# create a dataframe
df = pd.DataFrame(data)


# Show the top records
df.head()

In [ ]:
df.dropna(axis = "columns")

In [ ]:
df.dropna(axis = "rows")

In [ ]:

df.dropna(axis = "rows", how = "all")
df.dropna(axis = "rows", how = "any")
df.dropna(axis = "rows", how = "any", subset=["name", "ID"]) # consider only specific columns

# FillNA

In [ ]:
df.head()

In [ ]:
df.fillna(0)

In [ ]:
df["score"].mean()

In [ ]:
df.fillna({
    "ID": -999,
    "name": "Not found",
    "score" : df["score"].mean()
})

In [ ]:
df.head()

In [ ]:
df.fillna(method = "ffill")
df.fillna(method = "bfill")

# Duplicates

In [ ]:
data = {
    "ID" : [1,2,2,3],
    "name": ["Thomas", "Ingo", "Ingo", "Lena"]

}

df = pd.DataFrame(data)
df.head()

In [131]:
df.head()

   ID    name
0   1  Thomas
1   2    Ingo
2   2    Ingo
3   3    Lena

In [ ]:
df.duplicated()

In [ ]:
# Get the duplicated rows
df.loc [ df.duplicated()  ]

# Drop_duplicates()

In [133]:
df.drop_duplicates()
df.drop_duplicates(keep="first")
df.drop_duplicates(keep="last")

   ID    name
0   1  Thomas
2   2    Ingo
3   3    Lena

# Pandas Series String

In [140]:
df = pd.DataFrame({
    "ID" : [1,2,3,4],
    "name": ["thomas meier", "ali Meier    ", "    ingo mEier Möller", " Steffi"]
})


df.head()

   ID                   name
0   1           thomas meier
1   2          ali Meier
2   3      ingo mEier Möller
3   4                 Steffi

In [153]:
df["name"].str.upper()
df["name"].str.lower()
df["name"].str.title()
df["name"].str.strip()
df["name"].str.capitalize()


df.loc[ df["name"].str.startswith("t") ]

df.loc[df["name"].str.contains("m")]

df.loc[df["name"].str.contains("m|M")]

df.loc [df["name"].str.len() > 10]

   ID                   name
0   1           thomas meier
1   2          ali Meier
2   3      ingo mEier Möller

# Group By

In [157]:
participants = [
    (10, "Thomas", 40,"Belin", 70),
    (20, "Ingo", 40,"Belin", 70),
    (30, "Sara", 40,"Aachen", 70),
    (40, "Lena", 40,"Aachen", 70),
]

df = pd.DataFrame(participants, columns=["ID", "name", "age", "city" ,"score"])
df = df.set_index("ID")
df.head()

      name  age    city  score
ID
10  Thomas   40   Belin     70
20    Ingo   40   Belin     70
30    Sara   40  Aachen     70
40    Lena   40  Aachen     70

In [159]:
groups = df.groupby("city")
print(groups)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000221B9903D70>

In [162]:
for group_name, rows in groups:
    print(group_name)
    print(rows)

Aachen
    name  age    city  score
ID
30  Sara   40  Aachen     70
40  Lena   40  Aachen     70
Belin
      name  age   city  score
ID
10  Thomas   40  Belin     70
20    Ingo   40  Belin     70

In [163]:
group_aachen = groups.get_group("Aachen")

group_aachen.head()

    name  age    city  score
ID
30  Sara   40  Aachen     70
40  Lena   40  Aachen     70

In [164]:
mean_values = groups.mean(numeric_only=True)
mean_values

         age  score
city
Aachen  40.0   70.0
Belin   40.0   70.0

In [165]:
result = groups.agg({
    "age": "mean",
    "score" : "sum"
})

result

         age  score
city
Aachen  40.0    140
Belin   40.0    140